Repository: ohthehugemanatee/janetv
Catalog: sites/all/modules/flash_gallery/translations/flash_gallery-module.*.po
Languages: hu

source: Flash Gallery
hu: Flash galéria

source: Provide a flash version of the image gallery using 3rd party Simpleviewer tool.
hu: Gondoskodik a képgaléria flash verziójáról, a Simpleviewer eszközkészlet segítségével.

source: Allows displaying image galleries with Flash animation
hu: Lehetővé teszi a képgalériák Flash animációval történő megjelenítését.

source: Flash Galleries
hu: Flash galériák

source: administer flash gallery
hu: a flash galériák adminisztrálása

source: Image galleries
hu: Galériák

source: Both image module and image_gallery module should be enabled to use flash galleries.
hu: A flash galéria használatához a kép modul valamint a kép galéria modul bekapcsolása is szükséges.

source: There is 1 image in this gallery
hu: Jelenleg 1 kép van ebben a galériában

source: Last updated: %date
hu: Utolsó módosítás: %date

source: <div id="flashcontent">Macromedia Flash is required. <a href="http://www.macromedia.com/go/getflashplayer/">Download Macromedia Flash.</a></div>
hu: <div id="flashcontent">A lejátszáshoz Macromedia Flash Player-re van szükség. A <a href="http://www.macromedia.com/go/getflashplayer/">Macromedia Flash Player letöltése.</a></div>

source: download
hu: letöltés

source: dimensions
hu: méretek

source: All dimensions should be given in pixels.
hu: Minden méretet képpontban kell megadni.

source: width of flash animation
hu: a flash animáció szélessége

source: height of flash animation
hu: a flash animáció magassága

source: width of your largest image in pixels
hu: a legnagyobb kép szélessége (képpontban)

source: Used to determine the best layout for your gallery.
hu: Itt határozható meg a legjobb elrendezés a galériához.

source: height of your largest image in pixels
hu: a legnagyobb kép magassága (képpontban)

source: width of image frame in pixels
hu: a képkeret szélessége (képpont)

source: stage padding
hu: térköz

source: Distance between image and thumbnails and around gallery edge in pixels.
hu: Távolság a kép és a bélyegkép valamint a galériát övező keret közt.

source: colors
hu: színek

source: All colors should be given as hexadecimal rgb-values.
hu: Minden színt hexadecimális kódban kell megadni (mint html-ben).

source: background color
hu: háttérszín

source: Background color of flash animation.
hu: A flash animáció hátterének színe.

source: tranparency
hu: áttetszőség

source: Checking this box will make your background transparent. This setting overrides the background color setting.
hu: E kockát megjelölve a háttér áttetszővé tehető. Ez a beállítás felülírja a háttérszín beállításokat.

source: flash loader color
hu: flash töltő színe

source: Color of part of flash animation that says "loading xml data", while loading your gallery.
hu: A flash animáció azon alkatrészének színe, amely az „xml adat letöltése” üzenetet írja ki, a galéria betöltése közben.

source: text color
hu: szövegszín

source: Color of title and caption text.
hu: A címek és képaláírások színe.

source: frame color
hu: keretszín

source: Color of image frame, navigation buttons (on top and hover buttons) and thumbnail frame.
hu: A képkeretek, navigációs gombok (felengedett és lenyomott gombok) és a bélyegképek keretének színe.

source: navigation
hu: navigáció

source: top
hu: fel

source: bottom
hu: le

source: left
hu: bal

source: right
hu: jobb

source: navigation position
hu: navigáció pozició

source: Position of thumbnails relative to image.
hu: A bélyegképek relatív helyzete a nagyképekhez képest.

source: thumbnail columns
hu: bélyegkép oszlopok

source: Number of thumbnail columns. To disable thumbnails completely set this value to 0
hu: A bélyegképek oszlopainak száma. A bélyegképek tiltásához ezt az értéket 0-ra kell állítani.

source: thumbnail rows
hu: bélyegkép sorok

source: Number of thumbnail rows. To disable thumbnails completely set this value to 0.
hu: A bélyegképek sorainak száma. A bélyegképek tiltásához ezt az értéket 0-ra kell állítani.

source: miscellaneous
hu: egyéb

source: display title
hu: cím megjelenítése

source: Whether to display the node title in the flash animation.
hu: Megjelenjen-e a tartalom címe a flash animációban.

source: display album name
hu: galéria nevének megjelenítése

source: Whether to display the album name in the flash animation.
hu: Megjelenjen-e a galéria neve a flash animációban.

source: display download link
hu: letöltés link megjelenítése

source: Apart from the node title, also display a clickable link to allow downloading the originally uploaded image.
hu: A tartalom címe mellett ugyanúgy megjeleníthető egy klikkelhető link is, lehetővé téve az eredetileg feltöltött képek megtekintését.

source: build thumbnail library
hu: bélyegkép könyvtár építése

source: Normally, you should do this only once, after installing the module. This builds a library of thumbnails based on pre-existing images which reside inside pre-exising galleries. You do not have to repeat this later on: images that are created after installing this module are handled automatically.
hu: Normál esetben ezt csak egyszer, a modul telepítésekor kell megtenni, tehát nem kell megismételni később. A képek létrejönnek a telepítés után, a modul automatikusan kezeli a bélyegképeket.

source: Not all thumbnails were successfully created
hu: Nem minden bélyegképet sikerült létrehozni.

source: Thumbnail library was successfully created
hu: A bélyegkép könyvtár létre lett hozva.
